public class Task5 {
    public static void main(String[] args) {

    }
}
//    Задача эту неделю:
//        У нас уже есть все для старта продаж, но как мы поймем сколько машин мы продали, какую прибыль получили?
//        Нам необходима статистика продаж!
//        Необходимо:
//        1. Дать менеджеру имя.
//        2. Создать класс Report, в котором будет отображаться вся статистика менеджера: имя менеджера,
//        проданные машины.
//        3. Во время продажи, менеджер должен обновить свой report - добавить проданную машину в список.
//        4. Сделать справочник по моделям машин: camry - себестоимость 5000, solara - 8000, hiance - 10000, dyna - 12000
//        5. У менеджера должен появиться метод: сгенерируй отчет, в котором он выводит информацию в файл txt формата:
//        Имя менеджера
//        Модель №1 - стоимость продажи - себестоимость
//        Модель №2 - стоимость продажи - себестоимость
//        ....
//        Итог: доходы - (сумма всех продаж), расходы (сумма всех себестоимостей), прибыль - (доходы - расходы)